; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob23) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate6)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate7)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear crate9)
	(at pallet6 distributor1)
	(clear pallet6)
	(at pallet7 depot1)
	(clear crate10)
	(at pallet8 distributor1)
	(clear crate2)
	(at pallet9 distributor2)
	(clear pallet9)
	(at pallet10 depot0)
	(clear crate8)
	(at truck0 depot0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 374)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 266)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor1)
	(available hoist6)
	(at hoist7 depot0)
	(available hoist7)
	(at hoist8 distributor0)
	(available hoist8)
	(at hoist9 distributor0)
	(available hoist9)
	(at hoist10 distributor2)
	(available hoist10)
	(at hoist11 distributor1)
	(available hoist11)
	(at hoist12 depot1)
	(available hoist12)
	(at crate0 distributor1)
	(on crate0 pallet8)
	(= (weight crate0) 76)
	(at crate1 distributor2)
	(on crate1 pallet5)
	(= (weight crate1) 16)
	(at crate2 distributor1)
	(on crate2 crate0)
	(= (weight crate2) 73)
	(at crate3 distributor0)
	(on crate3 pallet3)
	(= (weight crate3) 14)
	(at crate4 depot0)
	(on crate4 pallet0)
	(= (weight crate4) 85)
	(at crate5 depot0)
	(on crate5 pallet10)
	(= (weight crate5) 92)
	(at crate6 depot0)
	(on crate6 crate4)
	(= (weight crate6) 63)
	(at crate7 distributor0)
	(on crate7 crate3)
	(= (weight crate7) 89)
	(at crate8 depot0)
	(on crate8 crate5)
	(= (weight crate8) 73)
	(at crate9 distributor2)
	(on crate9 crate1)
	(= (weight crate9) 58)
	(at crate10 depot1)
	(on crate10 pallet7)
	(= (weight crate10) 35)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet6)
		(on crate2 crate0)
		(on crate3 pallet10)
		(on crate4 crate7)
		(on crate5 crate10)
		(on crate6 pallet8)
		(on crate7 crate3)
		(on crate8 pallet1)
		(on crate9 pallet7)
		(on crate10 crate6)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist5 crate9 crate1 distributor2)
   deleted: (at crate9 distributor2) (clear crate9) (available hoist5) (on crate9 crate1)
   added: (lifting hoist5 crate9) (clear crate1)
   changed: (fuel-cost) from 0 to 1
   goals met: 2 of 10
2. (lift hoist7 crate8 crate5 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist7) (on crate8 crate5)
   added: (lifting hoist7 crate8) (clear crate5)
   changed: (fuel-cost) from 1 to 2
   goals met: 2 of 10
3. (load hoist7 crate8 truck0 depot0)
   deleted: (lifting hoist7 crate8)
   added: (in crate8 truck0) (available hoist7)
   changed: (current_load truck0) from 0 to 73
   goals met: 2 of 10
4. (lift hoist7 crate5 pallet10 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist7) (on crate5 pallet10)
   added: (lifting hoist7 crate5) (clear pallet10)
   changed: (fuel-cost) from 2 to 3
   goals met: 2 of 10
5. (load hoist7 crate5 truck0 depot0)
   deleted: (lifting hoist7 crate5)
   added: (in crate5 truck0) (available hoist7)
   changed: (current_load truck0) from 73 to 165
   goals met: 2 of 10
6. (lift hoist0 crate6 crate4 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 crate4)
   added: (lifting hoist0 crate6) (clear crate4)
   changed: (fuel-cost) from 3 to 4
   goals met: 2 of 10
7. (lift hoist7 crate4 pallet0 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist7) (on crate4 pallet0)
   added: (lifting hoist7 crate4) (clear pallet0)
   changed: (fuel-cost) from 4 to 5
   goals met: 2 of 10
8. (load hoist7 crate4 truck0 depot0)
   deleted: (lifting hoist7 crate4)
   added: (in crate4 truck0) (available hoist7)
   changed: (current_load truck0) from 165 to 250
   goals met: 2 of 10
9. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 5 to 15
   goals met: 2 of 10
10. (load hoist5 crate9 truck0 distributor2)
   deleted: (lifting hoist5 crate9)
   added: (in crate9 truck0) (available hoist5)
   changed: (current_load truck0) from 250 to 308
   goals met: 2 of 10
11. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 15 to 25
   goals met: 2 of 10
12. (unload hoist1 crate5 truck0 depot1)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck0) from 308 to 216
   goals met: 2 of 10
13. (unload hoist12 crate8 truck0 depot1)
   deleted: (in crate8 truck0) (available hoist12)
   added: (lifting hoist12 crate8)
   changed: (current_load truck0) from 216 to 143
   goals met: 2 of 10
14. (drop hoist12 crate8 pallet1 depot1)
   deleted: (lifting hoist12 crate8) (clear pallet1)
   added: (available hoist12) (at crate8 depot1) (clear crate8) (on crate8 pallet1)
   goals met: 3 of 10
15. (lift hoist11 crate2 crate0 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist11) (on crate2 crate0)
   added: (lifting hoist11 crate2) (clear crate0)
   changed: (fuel-cost) from 25 to 26
   goals met: 2 of 10
16. (lift hoist6 crate0 pallet8 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist6) (on crate0 pallet8)
   added: (lifting hoist6 crate0) (clear pallet8)
   changed: (fuel-cost) from 26 to 27
   goals met: 2 of 10
17. (drop hoist6 crate0 pallet6 distributor1)
   deleted: (lifting hoist6 crate0) (clear pallet6)
   added: (available hoist6) (at crate0 distributor1) (clear crate0) (on crate0 pallet6)
   goals met: 3 of 10
18. (drop hoist11 crate2 crate0 distributor1)
   deleted: (lifting hoist11 crate2) (clear crate0)
   added: (available hoist11) (at crate2 distributor1) (clear crate2) (on crate2 crate0)
   goals met: 4 of 10
19. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 27 to 37
   goals met: 4 of 10
20. (unload hoist3 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist3)
   added: (lifting hoist3 crate4)
   changed: (current_load truck0) from 143 to 58
   goals met: 4 of 10
21. (lift hoist12 crate10 pallet7 depot1)
   deleted: (at crate10 depot1) (clear crate10) (available hoist12) (on crate10 pallet7)
   added: (lifting hoist12 crate10) (clear pallet7)
   changed: (fuel-cost) from 37 to 38
   goals met: 4 of 10
22. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 38 to 48
   goals met: 4 of 10
23. (drop hoist12 crate10 crate8 depot1)
   deleted: (lifting hoist12 crate10) (clear crate8)
   added: (available hoist12) (at crate10 depot1) (clear crate10) (on crate10 crate8)
   goals met: 4 of 10
24. (unload hoist12 crate9 truck0 depot1)
   deleted: (in crate9 truck0) (available hoist12)
   added: (lifting hoist12 crate9)
   changed: (current_load truck0) from 58 to 0
   goals met: 4 of 10
25. (drop hoist12 crate9 pallet7 depot1)
   deleted: (lifting hoist12 crate9) (clear pallet7)
   added: (available hoist12) (at crate9 depot1) (clear crate9) (on crate9 pallet7)
   goals met: 5 of 10
26. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 48 to 58
   goals met: 5 of 10
27. (load hoist0 crate6 truck0 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 63
   goals met: 5 of 10
28. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 58 to 68
   goals met: 5 of 10
29. (unload hoist12 crate6 truck0 depot1)
   deleted: (in crate6 truck0) (available hoist12)
   added: (lifting hoist12 crate6)
   changed: (current_load truck0) from 63 to 0
   goals met: 5 of 10
30. (drop hoist12 crate6 crate9 depot1)
   deleted: (lifting hoist12 crate6) (clear crate9)
   added: (available hoist12) (at crate6 depot1) (clear crate6) (on crate6 crate9)
   goals met: 5 of 10
31. (lift hoist12 crate10 crate8 depot1)
   deleted: (at crate10 depot1) (clear crate10) (available hoist12) (on crate10 crate8)
   added: (lifting hoist12 crate10) (clear crate8)
   changed: (fuel-cost) from 68 to 69
   goals met: 5 of 10
32. (drop hoist12 crate10 crate6 depot1)
   deleted: (lifting hoist12 crate10) (clear crate6)
   added: (available hoist12) (at crate10 depot1) (clear crate10) (on crate10 crate6)
   goals met: 6 of 10
33. (lift hoist9 crate7 crate3 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist9) (on crate7 crate3)
   added: (lifting hoist9 crate7) (clear crate3)
   changed: (fuel-cost) from 69 to 70
   goals met: 5 of 10
34. (lift hoist8 crate3 pallet3 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist8) (on crate3 pallet3)
   added: (lifting hoist8 crate3) (clear pallet3)
   changed: (fuel-cost) from 70 to 71
   goals met: 5 of 10
35. (load hoist8 crate3 truck1 distributor0)
   deleted: (lifting hoist8 crate3)
   added: (in crate3 truck1) (available hoist8)
   changed: (current_load truck1) from 0 to 14
   goals met: 5 of 10
36. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 71 to 81
   goals met: 5 of 10
37. (unload hoist0 crate3 truck1 depot0)
   deleted: (in crate3 truck1) (available hoist0)
   added: (lifting hoist0 crate3)
   changed: (current_load truck1) from 14 to 0
   goals met: 5 of 10
38. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 81 to 91
   goals met: 5 of 10
39. (drop hoist0 crate3 pallet10 depot0)
   deleted: (lifting hoist0 crate3) (clear pallet10)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 pallet10)
   goals met: 6 of 10
40. (load hoist9 crate7 truck1 distributor0)
   deleted: (lifting hoist9 crate7)
   added: (in crate7 truck1) (available hoist9)
   changed: (current_load truck1) from 0 to 89
   goals met: 6 of 10
41. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 91 to 101
   goals met: 6 of 10
42. (unload hoist0 crate7 truck1 depot0)
   deleted: (in crate7 truck1) (available hoist0)
   added: (lifting hoist0 crate7)
   changed: (current_load truck1) from 89 to 0
   goals met: 6 of 10
43. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 101 to 111
   goals met: 6 of 10
44. (load hoist3 crate4 truck1 distributor0)
   deleted: (lifting hoist3 crate4)
   added: (in crate4 truck1) (available hoist3)
   changed: (current_load truck1) from 0 to 85
   goals met: 6 of 10
45. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 111 to 121
   goals met: 6 of 10
46. (drop hoist0 crate7 crate3 depot0)
   deleted: (lifting hoist0 crate7) (clear crate3)
   added: (available hoist0) (at crate7 depot0) (clear crate7) (on crate7 crate3)
   goals met: 7 of 10
47. (unload hoist7 crate4 truck1 depot0)
   deleted: (in crate4 truck1) (available hoist7)
   added: (lifting hoist7 crate4)
   changed: (current_load truck1) from 85 to 0
   goals met: 7 of 10
48. (drop hoist7 crate4 crate7 depot0)
   deleted: (lifting hoist7 crate4) (clear crate7)
   added: (available hoist7) (at crate4 depot0) (clear crate4) (on crate4 crate7)
   goals met: 8 of 10
49. (load hoist1 crate5 truck0 depot1)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 92
   goals met: 8 of 10
50. (lift hoist12 crate10 crate6 depot1)
   deleted: (at crate10 depot1) (clear crate10) (available hoist12) (on crate10 crate6)
   added: (lifting hoist12 crate10) (clear crate6)
   changed: (fuel-cost) from 121 to 122
   goals met: 7 of 10
51. (lift hoist1 crate6 crate9 depot1)
   deleted: (at crate6 depot1) (clear crate6) (available hoist1) (on crate6 crate9)
   added: (lifting hoist1 crate6) (clear crate9)
   changed: (fuel-cost) from 122 to 123
   goals met: 7 of 10
52. (load hoist1 crate6 truck0 depot1)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck0) (available hoist1)
   changed: (current_load truck0) from 92 to 155
   goals met: 7 of 10
53. (load hoist12 crate10 truck0 depot1)
   deleted: (lifting hoist12 crate10)
   added: (in crate10 truck0) (available hoist12)
   changed: (current_load truck0) from 155 to 190
   goals met: 7 of 10
54. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 123 to 133
   goals met: 7 of 10
55. (unload hoist4 crate6 truck0 distributor1)
   deleted: (in crate6 truck0) (available hoist4)
   added: (lifting hoist4 crate6)
   changed: (current_load truck0) from 190 to 127
   goals met: 7 of 10
56. (drop hoist4 crate6 pallet8 distributor1)
   deleted: (lifting hoist4 crate6) (clear pallet8)
   added: (available hoist4) (at crate6 distributor1) (clear crate6) (on crate6 pallet8)
   goals met: 8 of 10
57. (unload hoist4 crate10 truck0 distributor1)
   deleted: (in crate10 truck0) (available hoist4)
   added: (lifting hoist4 crate10)
   changed: (current_load truck0) from 127 to 92
   goals met: 8 of 10
58. (drop hoist4 crate10 crate6 distributor1)
   deleted: (lifting hoist4 crate10) (clear crate6)
   added: (available hoist4) (at crate10 distributor1) (clear crate10) (on crate10 crate6)
   goals met: 9 of 10
59. (unload hoist6 crate5 truck0 distributor1)
   deleted: (in crate5 truck0) (available hoist6)
   added: (lifting hoist6 crate5)
   changed: (current_load truck0) from 92 to 0
   goals met: 9 of 10
60. (drop hoist6 crate5 crate10 distributor1)
   deleted: (lifting hoist6 crate5) (clear crate10)
   added: (available hoist6) (at crate5 distributor1) (clear crate5) (on crate5 crate10)
   goals met: 10 of 10
